{
    "prospective": 
    {
        "title":"Prospective",
        "menu" : ["general-info", "Why CS?", "CEGEP", "Freshman", "Choosing a Major", "Transfer", "Internship", "UnderGraduate", "Graduate"],
        "general-info":
        {
            "name": "General Information",
            "content": [
            "<h2> McGill School of Computer Science</h2> <p> McGill University is one of the top research universities in Canada and is the only Canadian university to rank",
                "consistently among the top 25 universities in the world (based on Times and QS rankings). The School of Computer",
                "Science currently stands second in Canada for its research funding. Our professors have received most of the top",
                "awards in Computer Science, while our students go on to become top-notch research and industry leaders. A graduate",
                "degree from the McGill School of Computer Science is recognized in both the academic and industrial worlds as a",
                "proof of excellence.</p>",
            "<p> Our department is currently 34 faculty members strong, 60 Ph.D. students, and 100 Masters students. All of our Ph.D.",
                "students and most of our Masters students are funded through teaching assistantships or research assistantships.",
                "Approximately half our graduate students are Canadian and the other half are from abroad. </p>",
            "<h3>Location</h3> <p>McGill is an English language university located in the heart of Montreal, the second largest French-speaking city",
                "in the world. Montreal has a reputation for its cosmopolitan atmosphere, history, cultural and sport activities, and",
                "excellent restaurants. The cultural offerings of the city include a symphony orchestra, ballet, opera, several",
                "theaters and museums. For outdoor recreation, Mount Royal, a wooded mountain with a lake and parks located very",
                "close to the university, along with the St. Lawrence river, the many lakes and parks around the island of Montreal,",
                "provide opportunity for a wide variety of activities. Montreal consistently ranks among the most livable cities in",
                "the world, and the cost of living is among the lowest for cities of its size. The city is extremely safe and has an",
                "excellent public transportation system. Note that although speaking French is useful to fully enjoy your experience",
                "in Montreal, it is by no means necessary, as English is also spoken fluently by most of the population. More",
                "information can be found on the McGill Prospective Students web page, while information on Montreal is available",
                "from Montreal International.</p>",
            "<h3>The Academic Year</h3> <p> The academic year at McGill, as at most Canadian universities, has two terms (or semesters). These are the Fall term",
                "- early September to early December - and the Winter term - early January to mid-April.There is also a Summer term,",
                "although no graduate courses are offered during this session. It is used by students as a time for research or",
                "completing projects or theses. </p>",
            "<h3>Important Information for Foreign Students</h3>",
            "<p>All students who are not citizens or permanent residents of Canada are required to obtain the necessary Visa and/or",
                "Student Authorization documents prior to entering the country. Do NOT leave home without proper documentation! You",
                "CANNOT change your status from Visitor to Student when in Canada.</p>",
             "<p>Student Authorization: Issued by Canada Immigration through a Canadian Embassy or Consulate. There is a processing",
                "fee of $125 on all applications for Student Authorizations. LINK</p>",
            "<p>Certificate of Acceptance (CAQ): Issued by Quebec Immigration for a fee of $100. If there is no Quebec Immigration",
                "office in the country in which you are applying, you must fill out the application for a CAQ and send it to the",
                "Quebec Immigration Office in Montreal along with the $100 processing fee. Once CAQ is approved, Quebec Immigration",
                "will telex the Canadian Embassy you are dealing with. If there is a Quebec Immigration office in the country in",
                "which you are applying, you apply for the CAQ through them.</p>",
            "<p>Health Insurance (Compulsory): Quebec requires all international students to participate in a recognized Health",
                "Insurance Plan. Cost is approximately $500 per year for a single person. Most students use one of the insurance",
                "plans offered by McGill.</p>",
            "<p>Once accepted, all international students receive detailed instructions on immigration procedures. These instructions",
                "should be read very carefully to avoid unnecessary delays. Applicants are advised to begin procedures necessary to",
                "ensure admission to Canada and complete required medical papers for Canadian Immicolor",
            "</p><h3>Student Accommodation</h3>",
            "<p>Off-campus housing is the most popular among McGill graduate students, as it is usually affordable, convenient, and",
                "easy to find. The Off-Campus Housing Service keeps a computerized list of available housing within walking distance",
                "of McGill, or easily accessible by metro and bus lines. Most listings are checked to ensure minimum standards of",
                "cleanliness and state of repair. Rental rates vary according to accommodation desired, but are considered very",
                "reasonable in comparison with most North American cities. The University maintains a limited number of apartment",
                "units in several nearby locations. Housing request forms can be obtained from the Graduate Housing office.</p>"
            ]
        },

        "whyCS":
        {
            "name": "Why CS?",
            "content": [
            "<h2> Why CS?</h2> <h3>What is Computer Science?</h3><p> Computer science encompasses everything from theory to applications,",
            " including software engineering, programming languages, robotics, compilers, databases, game design and development, operating systems,",
            " artificial intelligence, computational biology, computer vision, and the analysis of algorithms.</p>",
            "<h3>Studying Computer Science at McGill</h3><p> Our department is currently 34 faculty members strong, 60 Ph.D. students, and 100 Masters students. All of our Ph.D.",
                "students and most of our Masters students are funded through teaching assistantships or research assistantships.",
                "Approximately half our graduate students are Canadian and the other half are from abroad. </p>",
            "<h3>Location</h3> <p>You can study Computer Science at McGill in many different ways. One typical way is by completing a Bachelor of ",
                "Science (B.Sc.) degree program in the Faculty of Science. You can choose the amount and nature of the computer ",
                "science courses that you take by selecting different program options. For example, a Major in Computer Science ",
                "requires you to take 60 credits of computer science or related courses. On the other hand, a Minor in Computer Science ",
                "requires you to take only 24 credits of computer science or related courses. Most computer science courses are worth 3 or 4 credits.",
            "<h3>The School of Computer Science</h3> <p> The School of Computer Science is part of the Faculty of Science.",
            " The School of Computer Science groups 34 faculty members who teach and do research on a wide variety of computer",
            " science and software engineering topics. The School of Computer Science is located in the McConnell Engineering and Trottier Buildings.",
            " Courses at McGill are taught in English. For most upper-level computer science courses, classes are small (about 10-30 students), and students",
            " have numerous opportunities for direct interaction with professors, both inside and outside the classroom. </p>"
            ]
        }
    }

}